print("""
        ||                ||                ||
       =||=              =||=               ||
      ==||==            ==||==              ||
     ===||===          ===||===             ||
    ====||====        ====||====            ||
   =====||=====      =====||=====           ||
  ======||======    ======||======    ======||======
       //\\\\              //\\\\              //\\\\
""")

towers = [[1,2,3,4],[],[]]

#   TODO
# Необходимо сделать функцию, которая будет обрабатывать все
# основные действия игры (звучит очень обстрактно)
def main():
    pass

#   TODO
# Необходимо сделать функцию, которая будет брать знание  из
# донорского массива и добавлять его в в акцепторский, пред-
# варительно удалив из донорского
def makeMove():
    pass    

#   TODO
# Необходимо сделать функцию, который будет принимать на вход
# два значения донорской башни и  акцепторской башни и прове-
# ть возможность переноса диска 
def checkMove():
    pass

#   TODO
# Необходимо сделать функцию, который будет принимать на вход
# три массива и выдавать строку с тремя башнями в ASCII стиле
def getASCIITowers():
    pass

